Vue.component('wishes', {
template: 
`<div class="tab-pane " id="wish" role="tabpanel" aria-labelledby="wish-tab">
                <div class="content ml-0">
                    <ul>
                        <li class="unselectable">МИР</li>
<li>- Хотелось бы дополнительные уровни Боевого пропуска как в Honkai Impact 3rd.</li>
<li>- Сделайте сохранение очков Судьбы в оружейном баннере при его смене на новый!!!</li>

<li>- Кнопка для быстрого сбора руды, экспедиций, сделанного декора в чайнике.</li>
<li>- Отдельная кнопка для сухпайка и еще одного инструмента.</li>
<li>- Возможность прервать не важный диалог (разные НПС в городах, таблички и пр.), не заканчивая его.</li>
<li>- Готовность элементального навыка на экране, по аналогии со взрывом стихий.</li>
<li>- Визуальный эффект длительности баффов от еды и зелий, чтобы видеть когда он закончится.</li>
<li>- Визуализация шкалы прочности щита над шкалой хп.</li>
<li>- Выбирать пачки для бездны как в быстром доступе при смене отряда, чтобы персонажи помечались цифрами 1-2-3-4 и менять первых не меняя порядок последних.</li>
<li>- Выбирать своих персонажей для пачки в тестовых забегах к тестируемому.</li>
<li>- Возможность блокировать выпадение одного легендарного персонажа или оружия, чтобы не выпадало со стандартного баннера или при проигрыше с ивентового.</li>

<li class="unselectable">---</li>
<li>- Добавьте больше выражений лица и поз персонажам в режиме камеры.</li>

<li class="unselectable">---</li>
<li>- Расширьте количество слотов для добавления друзей.</li>
<li>- Расширьте количество меток на карте.</li>
<li>- Расширьте количество слотов на стенде в профиле для персонажей и именных карточек.</li>
<li>- Сделайте возможность телепортации на ПК быстрым нажатием (ПКМ или двойное нажатие ЛКМ), чтобы не выбирались ближайшие метки.</li>
<li>- Сделайте возможность ставить временные метки на карте (пинговать) в кооперативном режиме, которые будут видеть все члены отряда.</li>
<li>- Добавьте возможность сохранять группы артов/быстро менять пачками арты между персонажами.</li>
<li>- Сделайте сортировку в автоматической загрузке артов от лучшего качество до худшего при вливании их в другие арты и наоборот.</li>


<li class="unselectable">ЧАЙНИК БЕЗМЯТЕЖНОСТИ</li>

<li>- Иконки ног, как у мест для сидения, в какую сторону будет заспавнен персонаж на телепортах в чайнике.</li>
<li>- Добавьте предметы с поворотом по вертикальной оси.</li>
<li>- Возможность отзеркаливать предметы в чайнике.</li>
<li>- Добавьте опцию включения/отключения отображения сетки других объектов при перемещении объекта, чтобы четко были видны границы других объектов.</li>


<li class="unselectable">---</li>
<li class="unselectable">МУСОР ПО ЖЕЛАНИЮ</li>
<li>- Ивенты связанные с боем слишком сложные для новичков или людей не имеющих большое количество персонажей.</li>
<li>- Уменьшить время отката смолы, 8 минут это очень долго. И увеличить хотя бы до 180 лимит.</li>
<li>- Возможность гладить животных.</li>
<li>- Нагрузка в чайнике требует доработки.</li>
<li>- Система садоводства оставляет желать лучшего, грядок мало, урожай собирать не очень удобно, ассортимент для выращивания не большой.</li>
<li>- Добавьте переносную табуретку чтобы можно было сидеть в любом месте мира.</li>

                    </ul>
                </div>
            </div>`
})